ws-asahi/UkiUkiCore/megaavr/boards.txt
# =====================================================================
#  UkiUkiCore - boards.txt
#  The UkiUkiduino product boards only (all other MCU/board families from
#  DxCore / WazamonoCore are removed):
#    - UkiUkiduino           (AVR64DU32, Arduino Uno R3 form factor, USB-C)
#    - UkiUkiduino ProMicro  (AVR64DU32, Pro Micro form factor, USB-C)
#  Derived from DxCore's avrduusb (USB-CDC bootloader) definition via
#  WazamonoCore; DxCore (C) Spence Konde, LGPL 2.1.
#  Customizations (C) Workshop Asahi.
#
#  Both boards are CRYSTAL-LESS by design and aimed at beginners: the
#  system clock is the internal OSCHF (24 MHz default, 16 MHz selectable;
#  build.speed / build.clocksource below). USB CLK_USB (48 MHz) = OSCHF +
#  PLL48M, SOF-tuned, independent of the system clock. PA0/PA1 (the XTALHF
#  pads) are used as on-board LED / button pins.
# =====================================================================

# =====================  UkiUkiduino (AVR64DU32)  =====================
#  Arduino Uno R3 form factor. AVR64DU32 + USB-CDC bootloader. Timer use:
#  millis() is on TCB0 so TCB1 is free for D3 PWM (TCB1 ALT1 = PF5) and
#  for tone() (Tone.cpp routes tone to TCB1 whenever millis is on TCB0;
#  tone therefore shares TCB1 with D3 PWM - using tone() suspends D3 PWM
#  only, exactly like Uno R3's Timer2, but D11 PWM (TCA0) is preserved).
menu.clock=Clock Speed
menu.usbeps=USB Endpoints

ukiukiduino.name=UkiUkiduino

ukiukiduino.upload.tool=avrdude
ukiukiduino.upload.prog_interlock=
# --- USB identity: pid.codes TEST-range placeholders (app 0x000C / boot 0x000B).
#     Replace with the official pid.codes VID/PID before release. Keep in sync
#     with variants/UkiUkiduino/pins_arduino.h and the bootloader build. ---
ukiukiduino.vid.0=0x1209
ukiukiduino.pid.0=0x000C
ukiukiduino.vid.1=0x1209
ukiukiduino.pid.1=0x000B
ukiukiduino.build.board=AVR_UKIUKIDUINO
ukiukiduino.build.core=dxcore
ukiukiduino.build.f_cpu={build.speed}000000L
ukiukiduino.build.text_section_start=.text=0x1000
ukiukiduino.build.defaultswaps=
ukiukiduino.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
ukiukiduino.menu.usbeps.ep8=8 (EP0-EP7, standard)
ukiukiduino.menu.usbeps.ep8.build.usbepflags=
ukiukiduino.menu.usbeps.ep16=16 (EP0-EP15, extended)
ukiukiduino.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/UkiUkiduino/ukiukiduino_init.cpp).
# Arduino archives variant objects into core.a, so its strong initVariant() that
# sets up the CCL/EVSYS LED mirror would otherwise be dropped (core main.cpp has
# a weak initVariant). -u pulls the member; the marker symbol is in that file.
ukiukiduino.compiler.c.elf.extra_flags=-Wl,-u,ukiukiduino_variant_keep -Wl,--defsym,__flmap_lock=1
ukiukiduino.build.rodata_flags=
ukiukiduino.build.export_merged_output=false
ukiukiduino.build.printf=
ukiukiduino.build.flmapopts=
ukiukiduino.build.attachmode=-DCORE_ATTACH_ALL
ukiukiduino.bootloader.tool=avrdude
ukiukiduino.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
ukiukiduino.bootloader.wdtwindowbits=0000
ukiukiduino.bootloader.BODCFG=0x00
ukiukiduino.bootloader.updipinbit=1
ukiukiduino.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
ukiukiduino.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
ukiukiduino.bootloader.CODESIZE=0x00
ukiukiduino.bootloader.BOOTSIZE=0x08
ukiukiduino.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
ukiukiduino.bootloader.wdttimeoutbits=0000
ukiukiduino.bootloader.eesavebit=1
ukiukiduino.bootloader.resetpinbit=1
ukiukiduino.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3 PWM + tone), Wire=single.
ukiukiduino.build.millistimer=B0
ukiukiduino.build.wiremode=MORS_SINGLE
ukiukiduino.bootloader.resetpinbits={bootloader.resetpinbit}
ukiukiduino.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
ukiukiduino.bootloader.pymcuprogstring=-aerase
ukiukiduino.build.mcupostfix=
ukiukiduino.build.printfabr=
ukiukiduino.build.flmapabr=.ful
ukiukiduino.build.attachabr=
ukiukiduino.build.wireabr=.wO
ukiukiduino.build.appspmabr=
ukiukiduino.upload.protocol=arduino
ukiukiduino.upload.speed=115200
ukiukiduino.upload.extra_params=-D
ukiukiduino.upload.use_1200bps_touch=true
ukiukiduino.upload.wait_for_upload_port=true
ukiukiduino.bootloader.file=hex/{bootloader.class}.hex
ukiukiduino.bootloader.appspm=

# --- Clock: fixed 24 MHz internal OSCHF (crystal-less; no Clock menu). ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF + PLL48M, SOF-tuned.
ukiukiduino.menu.clock.24internal=24 MHz internal
ukiukiduino.menu.clock.24internal.build.speed=24
ukiukiduino.menu.clock.24internal.build.clocksource=0
ukiukiduino.menu.clock.16internal=16 MHz internal
ukiukiduino.menu.clock.16internal.build.speed=16
ukiukiduino.menu.clock.16internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to UkiUkiduino. ---
ukiukiduino.build.mcu=avr64du32
ukiukiduino.build.variant=UkiUkiduino
ukiukiduino.build.highestcb=B2
ukiukiduino.upload.maximum_size=61440
ukiukiduino.upload.maximum_data_size=8192
ukiukiduino.bootloader.class=usbcdcboot_ukiukiduino

# =================  UkiUkiduino ProMicro (AVR64DU32)  =================
#  Pro Micro form factor (derived from the Wazamono Tachi rev.5 layout).
#  AVR64DU32 + USB-CDC bootloader, 5 V only (no regulator: RAW = VCC = +5V).
#  On-board: WS2812B full-color LED (LED_BUILTIN = D17, mirrored from PF5 to
#  PF4), user button BTN_BUILTIN = D22 (PF0, pull-down, pressed = HIGH),
#  TX/RX activity LEDs on PA0/PA1 (active-LOW). Timer use: millis() on TCB0,
#  TCB1 drives the exclusive D3/D4/D7 PWM outlet and tone(); TCA0 -> PORTD
#  gives the classic Pro Micro PWM set D5/D6/D9/D10 (+ D14/D16).
ukiukiduinopromicro.name=UkiUkiduino ProMicro

ukiukiduinopromicro.upload.tool=avrdude
ukiukiduinopromicro.upload.prog_interlock=
# --- USB identity: pid.codes TEST-range placeholders (app 0x000E / boot 0x000D;
#     distinct from the Uno-form UkiUkiduino so both can be plugged in at once).
#     Replace with the official pid.codes VID/PID before release. Keep in sync
#     with cores/dxcore/usb_descriptors.{h,c}, variants/UkiUkiduinoProMicro/
#     pins_arduino.h and the bootloader build (build_ukiukiduino.sh/.bat). ---
ukiukiduinopromicro.vid.0=0x1209
ukiukiduinopromicro.pid.0=0x000E
ukiukiduinopromicro.vid.1=0x1209
ukiukiduinopromicro.pid.1=0x000D
ukiukiduinopromicro.build.board=AVR_UKIUKIDUINO_PROMICRO
ukiukiduinopromicro.build.core=dxcore
ukiukiduinopromicro.build.f_cpu={build.speed}000000L
ukiukiduinopromicro.build.text_section_start=.text=0x1000
ukiukiduinopromicro.build.defaultswaps=
ukiukiduinopromicro.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
ukiukiduinopromicro.menu.usbeps.ep8=8 (EP0-EP7, standard)
ukiukiduinopromicro.menu.usbeps.ep8.build.usbepflags=
ukiukiduinopromicro.menu.usbeps.ep16=16 (EP0-EP15, extended)
ukiukiduinopromicro.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/UkiUkiduinoProMicro/
# ukiukiduinopromicro_init.cpp): strong initVariant() (LED blanking) plus the
# USB-CDC TX/RX activity-LED hooks would otherwise be dropped from core.a.
ukiukiduinopromicro.compiler.c.elf.extra_flags=-Wl,-u,ukiukiduinopromicro_variant_keep -Wl,--defsym,__flmap_lock=1
ukiukiduinopromicro.build.rodata_flags=
ukiukiduinopromicro.build.export_merged_output=false
ukiukiduinopromicro.build.printf=
ukiukiduinopromicro.build.flmapopts=
ukiukiduinopromicro.build.attachmode=-DCORE_ATTACH_ALL
ukiukiduinopromicro.bootloader.tool=avrdude
ukiukiduinopromicro.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
ukiukiduinopromicro.bootloader.wdtwindowbits=0000
ukiukiduinopromicro.bootloader.BODCFG=0x00
ukiukiduinopromicro.bootloader.updipinbit=1
ukiukiduinopromicro.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
ukiukiduinopromicro.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
ukiukiduinopromicro.bootloader.CODESIZE=0x00
ukiukiduinopromicro.bootloader.BOOTSIZE=0x08
ukiukiduinopromicro.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
ukiukiduinopromicro.bootloader.wdttimeoutbits=0000
ukiukiduinopromicro.bootloader.eesavebit=1
ukiukiduinopromicro.bootloader.resetpinbit=1
ukiukiduinopromicro.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3/D4/D7 PWM + tone), Wire=single.
ukiukiduinopromicro.build.millistimer=B0
ukiukiduinopromicro.build.wiremode=MORS_SINGLE
ukiukiduinopromicro.bootloader.resetpinbits={bootloader.resetpinbit}
ukiukiduinopromicro.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduinopromicro.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduinopromicro.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
ukiukiduinopromicro.bootloader.pymcuprogstring=-aerase
ukiukiduinopromicro.build.mcupostfix=
ukiukiduinopromicro.build.printfabr=
ukiukiduinopromicro.build.flmapabr=.ful
ukiukiduinopromicro.build.attachabr=
ukiukiduinopromicro.build.wireabr=.wO
ukiukiduinopromicro.build.appspmabr=
ukiukiduinopromicro.upload.protocol=arduino
ukiukiduinopromicro.upload.speed=115200
ukiukiduinopromicro.upload.extra_params=-D
ukiukiduinopromicro.upload.use_1200bps_touch=true
ukiukiduinopromicro.upload.wait_for_upload_port=true
ukiukiduinopromicro.bootloader.file=hex/{bootloader.class}.hex
ukiukiduinopromicro.bootloader.appspm=

# --- Clock: fixed 24 MHz internal OSCHF (crystal-less; no Clock menu). ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF + PLL48M, SOF-tuned.
ukiukiduinopromicro.menu.clock.24internal=24 MHz internal
ukiukiduinopromicro.menu.clock.24internal.build.speed=24
ukiukiduinopromicro.menu.clock.24internal.build.clocksource=0
ukiukiduinopromicro.menu.clock.16internal=16 MHz internal
ukiukiduinopromicro.menu.clock.16internal.build.speed=16
ukiukiduinopromicro.menu.clock.16internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to UkiUkiduino ProMicro. ---
ukiukiduinopromicro.build.mcu=avr64du32
ukiukiduinopromicro.build.variant=UkiUkiduinoProMicro
ukiukiduinopromicro.build.highestcb=B2
ukiukiduinopromicro.upload.maximum_size=61440
ukiukiduinopromicro.upload.maximum_data_size=8192
ukiukiduinopromicro.bootloader.class=usbcdcboot_ukiukiduinopromicro
